; domain
(define (domain emergency-services-transporters)
  (:requirements :strips :typing :action-costs)

  (:types
    location person drone crate content transporter num
  )

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)
    (at-transporter ?t - transporter ?l - location)
    (hand-empty ?d - drone)
    (holding ?d - drone ?c - crate)
    (crate-content ?c - crate ?cnt - content)
    (has-content ?p - person ?cnt - content)
    (in-transporter ?c - crate ?t - transporter)
    (free-slots ?t - transporter ?n - num)
    (siguiente ?n1 - num ?n2 - num)
  )

  (:functions
    (total-cost)
    (fly-cost ?from - location ?to - location)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition (at-drone ?d ?from)
    :effect (and
      (not (at-drone ?d ?from))
      (at-drone ?d ?to)
      (increase (total-cost) (fly-cost ?from ?to))
    )
  )

  (:action pick-up
    :parameters (?d - drone ?c - crate ?l - location)
    :precondition (and
      (at-drone ?d ?l)
      (at-crate ?c ?l)
      (hand-empty ?d)
    )
    :effect (and
      (not (at-crate ?c ?l))
      (not (hand-empty ?d))
      (holding ?d ?c)
      (increase (total-cost) 1)
    )
  )

  (:action deliver
    :parameters (?d - drone ?c - crate ?p - person ?l - location ?cnt - content)
    :precondition (and
      (at-drone ?d ?l)
      (at-person ?p ?l)
      (holding ?d ?c)
      (crate-content ?c ?cnt)
    )
    :effect (and
      (not (holding ?d ?c))
      (hand-empty ?d)
      (has-content ?p ?cnt)
      (increase (total-cost) 1)
    )
  )

  (:action put-in-transporter
    :parameters (?d - drone ?c - crate ?t - transporter ?l - location ?n-new - num ?n-old - num)
    :precondition (and
      (at-drone ?d ?l)
      (at-transporter ?t ?l)
      (holding ?d ?c)
      (free-slots ?t ?n-old)
      (siguiente ?n-new ?n-old)
    )
    :effect (and
      (not (holding ?d ?c))
      (hand-empty ?d)
      (in-transporter ?c ?t)
      (not (free-slots ?t ?n-old))
      (free-slots ?t ?n-new)
      (increase (total-cost) 1)
    )
  )

  (:action move-transporter
    :parameters (?d - drone ?t - transporter ?from - location ?to - location)
    :precondition (and
      (at-drone ?d ?from)
      (at-transporter ?t ?from)
      (hand-empty ?d)
    )
    :effect (and
      (not (at-drone ?d ?from))
      (at-drone ?d ?to)
      (not (at-transporter ?t ?from))
      (at-transporter ?t ?to)
      (increase (total-cost) (fly-cost ?from ?to))
    )
  )

  (:action take-out-transporter
    :parameters (?d - drone ?c - crate ?t - transporter ?l - location ?n-old - num ?n-new - num)
    :precondition (and
      (at-drone ?d ?l)
      (at-transporter ?t ?l)
      (in-transporter ?c ?t)
      (hand-empty ?d)
      (free-slots ?t ?n-old)
      (siguiente ?n-old ?n-new)
    )
    :effect (and
      (not (in-transporter ?c ?t))
      (not (hand-empty ?d))
      (holding ?d ?c)
      (not (free-slots ?t ?n-old))
      (free-slots ?t ?n-new)
      (increase (total-cost) 1)
    )
  )
)

; problem
(define (problem problem_d1_r1_l5_p5_c5_g5)
(:domain emergency-services-transporters)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	transporter1 - transporter
	n0 - num
	n1 - num
	n2 - num
	n3 - num
	n4 - num
)
(:init
	(at-drone drone1 depot)
	(hand-empty drone1)
	(at-transporter transporter1 depot)
	(free-slots transporter1 n4)
	(at-crate crate1 depot)
	(at-crate crate2 depot)
	(at-crate crate3 depot)
	(at-crate crate4 depot)
	(at-crate crate5 depot)
	(at-person person1 loc4)
	(at-person person2 loc4)
	(at-person person3 loc4)
	(at-person person4 loc1)
	(at-person person5 loc2)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 medicine)
	(crate-content crate4 medicine)
	(crate-content crate5 medicine)
	(siguiente n0 n1)
	(siguiente n1 n2)
	(siguiente n2 n3)
	(siguiente n3 n4)
	(= (total-cost) 0)
	(= (fly-cost depot depot) 1)
	(= (fly-cost depot loc1) 72)
	(= (fly-cost depot loc2) 173)
	(= (fly-cost depot loc3) 139)
	(= (fly-cost depot loc4) 217)
	(= (fly-cost depot loc5) 226)
	(= (fly-cost loc1 depot) 72)
	(= (fly-cost loc1 loc1) 1)
	(= (fly-cost loc1 loc2) 147)
	(= (fly-cost loc1 loc3) 125)
	(= (fly-cost loc1 loc4) 169)
	(= (fly-cost loc1 loc5) 178)
	(= (fly-cost loc2 depot) 173)
	(= (fly-cost loc2 loc1) 147)
	(= (fly-cost loc2 loc2) 1)
	(= (fly-cost loc2 loc3) 40)
	(= (fly-cost loc2 loc4) 68)
	(= (fly-cost loc2 loc5) 77)
	(= (fly-cost loc3 depot) 139)
	(= (fly-cost loc3 loc1) 125)
	(= (fly-cost loc3 loc2) 40)
	(= (fly-cost loc3 loc3) 1)
	(= (fly-cost loc3 loc4) 104)
	(= (fly-cost loc3 loc5) 114)
	(= (fly-cost loc4 depot) 217)
	(= (fly-cost loc4 loc1) 169)
	(= (fly-cost loc4 loc2) 68)
	(= (fly-cost loc4 loc3) 104)
	(= (fly-cost loc4 loc4) 1)
	(= (fly-cost loc4 loc5) 11)
	(= (fly-cost loc5 depot) 226)
	(= (fly-cost loc5 loc1) 178)
	(= (fly-cost loc5 loc2) 77)
	(= (fly-cost loc5 loc3) 114)
	(= (fly-cost loc5 loc4) 11)
	(= (fly-cost loc5 loc5) 1)
)
(:goal (and
	(has-content person1 medicine)
	(has-content person2 food)
	(has-content person2 medicine)
	(has-content person3 food)
	(has-content person4 medicine)
	))
(:metric minimize (total-cost))
)

; plan
1. (pick-up drone1 crate2 depot)
   deleted: (at-crate crate2 depot) (hand-empty drone1)
   added: (holding drone1 crate2)
   goals met: 0 of 5
2. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 0 of 5
3. (deliver drone1 crate2 person2 loc4 food)
   deleted: (holding drone1 crate2)
   added: (hand-empty drone1) (has-content person2 food)
   goals met: 1 of 5
4. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 1 of 5
5. (pick-up drone1 crate1 depot)
   deleted: (at-crate crate1 depot) (hand-empty drone1)
   added: (holding drone1 crate1)
   goals met: 1 of 5
6. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 1 of 5
7. (deliver drone1 crate1 person3 loc4 food)
   deleted: (holding drone1 crate1)
   added: (hand-empty drone1) (has-content person3 food)
   goals met: 2 of 5
8. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 2 of 5
9. (pick-up drone1 crate5 depot)
   deleted: (at-crate crate5 depot) (hand-empty drone1)
   added: (holding drone1 crate5)
   goals met: 2 of 5
10. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 2 of 5
11. (fly drone1 loc4 loc1)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 loc1)
   goals met: 2 of 5
12. (deliver drone1 crate5 person4 loc1 medicine)
   deleted: (holding drone1 crate5)
   added: (hand-empty drone1) (has-content person4 medicine)
   goals met: 3 of 5
13. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 3 of 5
14. (pick-up drone1 crate4 depot)
   deleted: (at-crate crate4 depot) (hand-empty drone1)
   added: (holding drone1 crate4)
   goals met: 3 of 5
15. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 3 of 5
16. (deliver drone1 crate4 person1 loc4 medicine)
   deleted: (holding drone1 crate4)
   added: (hand-empty drone1) (has-content person1 medicine)
   goals met: 4 of 5
17. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 4 of 5
18. (pick-up drone1 crate3 depot)
   deleted: (at-crate crate3 depot) (hand-empty drone1)
   added: (holding drone1 crate3)
   goals met: 4 of 5
19. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 4 of 5
20. (deliver drone1 crate3 person2 loc4 medicine)
   deleted: (holding drone1 crate3)
   added: (hand-empty drone1) (has-content person2 medicine)
   goals met: 5 of 5
